In [2]:
import pandas as pd

In [3]:
#There are 2 main data types in Pandas::
series=pd.Series(["BMW","Toyota","Jaguar"])

In [4]:
series

0       BMW
1    Toyota
2    Jaguar
dtype: object

In [5]:
#Series is 1-dimentional data type

In [6]:
colours=pd.Series(["Red","White","Blue"])

In [7]:
colours

0      Red
1    White
2     Blue
dtype: object

In [8]:
#DataFrame = 2-dimensional

In [9]:
car=pd.DataFrame({"Car make":series ,"Colours":colours})
car

  Car make Colours
0      BMW     Red
1   Toyota   White
2   Jaguar    Blue

In [10]:
#Import Data
car_data=pd.read_csv("car-sales.csv")

In [11]:
car_data

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [12]:
#Exporting a DataFrame
car_data.to_csv("car-sales-import.csv")

In [13]:
#Importing data from URL::
heart_disease = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")
heart_disease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

##Describe Data

In [14]:
#Attribute::(attribute doesn't have the bracket)
car_data.dtypes

Unnamed: 0        int64
Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [17]:
car_data.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [15]:
car_columns=car_data.columns
car_columns

Index(['Unnamed: 0', 'Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [16]:
car_data.index

RangeIndex(start=0, stop=10, step=1)

In [17]:
car_data

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [20]:
car_data.describe() #STATISTICAL INFO ABOUT THE DATA

       Unnamed: 0  Odometer (KM)      Doors
count    10.00000      10.000000  10.000000
mean      4.50000   78601.400000   4.000000
std       3.02765   61983.471735   0.471405
min       0.00000   11179.000000   3.000000
25%       2.25000   35836.250000   4.000000
50%       4.50000   57369.000000   4.000000
75%       6.75000   96384.500000   4.000000
max       9.00000  213095.000000   5.000000